Documents/ЛБ_УстановитьТекущийШаблонПриказа_ПроцентныеСтавки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_УстановитьТекущийШаблонПриказа_ПроцентныеСтавки</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЛБ_ТекущийШаблонПриказа</xr:Item>
				<xr:Item>InformationRegister.ЛБ_ТекущийШаблонПриказаАкции</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОперацийПриказы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаЛомбарды</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Шаблоны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СхемаКредитования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Акция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_Акции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Шаблон</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ШаблоныПриказовПроцентныеСтавки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонАкция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ШаблоныПриказовАкцииПроцентныеСтавки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Ломбарды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ломбард</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЛБ_ТекущийШаблонПриказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ТекущийШаблонПриказа</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ШаблонПриказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ШаблоныПриказовМеталлы</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ШаблоныПриказовВставки</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ШаблоныПриказовПроцентныеСтавки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидПрейскуранта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыПрейскурантов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ТекущийШаблонПриказаАкции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ТекущийШаблонПриказаАкции</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ШаблонПриказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ШаблоныПриказовМеталлы</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ШаблоныПриказовАкцииПроцентныеСтавки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидПрейскуранта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыПрейскурантов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Акция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Акции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыОперацийПриказы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыОперацийПриказы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Базовый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Акция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВИП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменитьВИП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_ВидыПрейскурантов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыПрейскурантов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПроцентныеСтавки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Металлы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вставки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЛБ_УстановитьТекущийШаблонПриказа_ПроцентныеСтавки/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.Базовый Тогда
		Движения.ЛБ_ТекущийШаблонПриказа.Записывать = Истина;  
		Если ЭтотОбъект.Ломбарды.Количество() = 0 Тогда
			Для каждого стр Из ЭтотОбъект.Шаблоны Цикл 
				Движение = Движения.ЛБ_ТекущийШаблонПриказа.Добавить();
			    Движение.Период = Дата; 
				Движение.ВидПрейскуранта = Перечисления.ЛБ_ВидыПрейскурантов.ПроцентныеСтавки;
				Движение.СхемаКредитования = Стр.СхемаКредитования;
				Движение.ШаблонПриказа = Стр.Шаблон;
			КонецЦикла;	 
		Иначе                                           
			Для каждого стрЛ Из ЭтотОбъект.Ломбарды Цикл
				Для каждого стр Из ЭтотОбъект.Шаблоны Цикл 
					Движение = Движения.ЛБ_ТекущийШаблонПриказа.Добавить();
				    Движение.Период = Дата; 
					Движение.ВидПрейскуранта = Перечисления.ЛБ_ВидыПрейскурантов.ПроцентныеСтавки;
					Движение.СхемаКредитования = Стр.СхемаКредитования;  
					Движение.Ломбард = СтрЛ.Ломбард;
					Движение.ШаблонПриказа = Стр.Шаблон;
				КонецЦикла;	 
			КонецЦикла;	
		КонецЕсли;	
	Иначе 
		Движения.ЛБ_ТекущийШаблонПриказаАкции.Записывать = Истина;   
		Для каждого стр Из ЭтотОбъект.Шаблоны Цикл 
			Движение = Движения.ЛБ_ТекущийШаблонПриказаАкции.Добавить();
		    Движение.Период = Дата; 
			Движение.ВидПрейскуранта = Перечисления.ЛБ_ВидыПрейскурантов.ПроцентныеСтавки;
			Движение.Акция = Стр.Акция;
			Движение.ШаблонПриказа = Стр.ШаблонАкция;
		КонецЦикла;	 
	КонецЕсли;	
КонецПроцедуры
